app/views/prescricoes/_form.html.erb

SELECT "pacientes".* FROM "pacientes"
---
     <%= form.label :paciente_id %>
     <%= form.collection_select :paciente_id, Paciente.all, :id, :nome_completo, prompt: "Selecione um paciente" %>