app/views/prescricoes/_form.html.erb

    <%= form.label :prontuario_id, "Prontuário do Paciente", style: "display: block" %>
    <%= form.collection_select :prontuario_id, Prontuario.all, :id, :codigo %>
---
SELECT "prontuarios".* FROM "prontuarios"

    <%= form.label :consulta_id, "Consulta", style: "display: block" %>
    <%= form.collection_select :consulta_id, Consulta.all, :id, :descricao %>
---
SELECT "consultas".* FROM "consultas"