app/controllers/consultas_controller.rb

  def index
    @consultas = Consulta.all
---
SELECT "consultas".* FROM "consultas"

  def create
    @consulta = Consulta.find(params[:consulta_id])
    @exame = @consulta.exames.build(exame_params)

    respond_to do |format|
      if @exame.save
---
SELECT "consultas".* FROM "consultas" WHERE "consultas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "consultas" ("data", "horario", "descricao", "paciente_id", "medico_id", "prontuario_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @consulta.destroy
---
DELETE FROM "consultas" WHERE "consultas"."id" = $1  [["id", 2]]

  def set_consulta
    if params[:id] == 'search'
      @consultas = Consulta.where('nome LIKE ?', "%#{params[:search_term]}%")
    else
      @consulta = Consulta.find(params[:id])
---
SELECT "consultas".* FROM "consultas" WHERE "consultas"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]