app/controllers/exames_controller.rb

  def index
    @consulta = Consulta.find(params[:consulta_id])
---
SELECT "consultas".* FROM "consultas" WHERE "consultas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def show
    @consulta = Consulta.find(params[:consulta_id])
    @exame = Exame.find(params[:id])
---
SELECT "consultas".* FROM "consultas" WHERE "consultas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "exames".* FROM "exames" WHERE "exames"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @consulta = Consulta.find(params[:consulta_id])
---
SELECT "consultas".* FROM "consultas" WHERE "consultas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def edit
    @consulta = Consulta.find(params[:consulta_id]) # Adicione esta linha
    @exame = Exame.find(params[:id])
---
SELECT "consultas".* FROM "consultas" WHERE "consultas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "exames".* FROM "exames" WHERE "exames"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @consulta = Consulta.find(params[:consulta_id])
    @exame = @consulta.exames.build(exame_params)

    respond_to do |format|
      if @exame.save
---
SELECT "consultas".* FROM "consultas" WHERE "consultas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "exames" ("cod", "data", "nomeExame", "descricao", "resultado", "prontuario_id", "consulta_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def destroy
    @exame.destroy
---
DELETE FROM "exames" WHERE "exames"."id" = $1  [["id", 3]]

  def set_exame
    @consulta = Consulta.find(params[:consulta_id]) # Adicione esta linha
    @exame = Exame.find_by(id: params[:id])
---
SELECT "consultas".* FROM "consultas" WHERE "consultas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "exames".* FROM "exames" WHERE "exames"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]