app/controllers/medicos_controller.rb

  def index
    @medico = Medico.all
---
SELECT "medicos".* FROM "medicos"

  def create
    @medico = Medico.new(medico_params)
    @medico.build_endereco

    respond_to do |format|
      if @medico.save
---
INSERT INTO "enderecos" ("cep", "cidade", "bairro", "numero", "logradouro", "complemento", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "medicos" ("nome", "lincenca", "especialidade", "cpf", "email", "user_id", "endereco_id", "created_at", "updated_at", "licenca", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def update
    respond_to do |format|
      if @medico.update(medico_params)
---
UPDATE "medicos" SET "nome" = $1, "endereco_id" = $2, "updated_at" = $3 WHERE "medicos"."id" = $4  [["nome", "Dr. Márcio José de Freitas Borges"], ["endereco_id", 11], ["updated_at", "2024-02-22 19:39:08.784716"], ["id", 6]]

  def destroy
    @medico.destroy
---
DELETE FROM "medicos" WHERE "medicos"."id" = $1  [["id", 6]]

  def set_medico
    @medico = Medico.find(params[:id])
---
SELECT "medicos".* FROM "medicos" WHERE "medicos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]