app/controllers/pacientes_controller.rb

  def index
    @pacientes = Paciente.all
---
SELECT "pacientes".* FROM "pacientes"

  def show
    @pacientes = Paciente.all
---
SELECT "pacientes".* FROM "pacientes"

  def create
    @paciente = Paciente.new(paciente_params)

    respond_to do |format|
      if @paciente.save
---
INSERT INTO "pacientes" ("nome_completo", "data_nascimento", "cpf", "email", "telefone", "user_id", "endereco_id", "created_at", "updated_at", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def set_paciente
    @paciente = Paciente.find(params[:id])
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]