app/controllers/prescricoes_controller.rb

  def create
    @consulta = Consulta.find(params[:prescricao][:consulta_id])
---
SELECT "consultas".* FROM "consultas" WHERE "consultas"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]