app/controllers/prescricoes_controller.rb

SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    @paciente = Paciente.find(params[:paciente_id])

SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @paciente = Paciente.find(params[:paciente_id])

SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    @paciente = Paciente.find(params[:paciente_id])

SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @paciente = Paciente.find(params[:paciente_id])

SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "prescricoes" ("cod", "data", "observacoes", "dosagem", "listaMedicamentos", "prontuario_id", "consulta_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @paciente = Paciente.find(params[:paciente_id])
    @prontuario = @paciente.prontuario
    @prescricao = @prontuario.prescricoes.build(prescricao_params)

    respond_to do |format|
      if @prescricao.save

SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_paciente
    @paciente = Paciente.find(params[:paciente_id])