app/controllers/prontuarios_controller.rb

  def index
    @prontuarios = Prontuario.all
---
SELECT "prontuarios".* FROM "prontuarios"

  def show
    @prontuario = Prontuario.find(params[:id])
---
SELECT "prontuarios".* FROM "prontuarios" WHERE "prontuarios"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def new
    @paciente = Paciente.find(params[:paciente_id])
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @paciente = Paciente.find(params[:paciente_id])
    @prontuario_existente = @paciente.prontuario

    if @prontuario_existente
      flash[:notice] = 'Paciente já possui um prontuário.'
      redirect_to paciente_prontuario_path(@paciente, @prontuario_existente)
    else
      @prontuario = @paciente.build_prontuario(prontuario_params)

      respond_to do |format|
        if @prontuario.save
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "prontuarios" ("codigo", "datacriacao", "historico", "paciente_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["codigo", 124], ["datacriacao", "2024-01-20"], ["historico", "fjgfod"], ["paciente_id", 4], ["created_at", "2024-02-22 16:41:43.930049"], ["updated_at", "2024-02-22 16:41:43.930049"]]

  def set_paciente
    Rails.logger.info "Procurando por paciente com ID: #{params[:paciente_id]}"
    @paciente = Paciente.find_by(id: params[:paciente_id])
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def set_prontuario
    @prontuario = Prontuario.find(params[:id])
---
SELECT "prontuarios".* FROM "prontuarios" WHERE "prontuarios"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]