app/views/exames/_form.html.erb

     <%= form.label :prontuario_id, "Prontuário:", style: "display: block" %>
     <%= form.collection_select :prontuario_id, Prontuario.all, :id, :codigo, prompt: 'Selecione um prontuário' %>
---
SELECT "prontuarios".* FROM "prontuarios"