app/models/consulta.rb

  def consulta_ocupada
    return unless medico && data.present? && horario.present?

    if medico.consultas.exists?(data: data, horario: horario)
---
SELECT 1 AS one FROM "consultas" WHERE "consultas"."medico_id" = $1 AND "consultas"."data" = $2 AND "consultas"."horario" = $3 LIMIT $4  [["medico_id", 1], ["data", "2024-02-22"], ["horario", "02:24:00"], ["LIMIT", 1]]