app/views/consultas/_form.html.erb

SELECT "medicos".* FROM "medicos"
---
    <%= form.label :medico_id %>
    <%= form.collection_select :medico_id, Medico.all, :id, :nome, prompt: "Selecione um médico" %>

SELECT "pacientes".* FROM "pacientes"
---
    <%= form.label :paciente_id %>
    <%= form.collection_select :paciente_id, Paciente.all, :id, :nome_completo, prompt: "Selecione um paciente" %>