app/views/consultas/index.html.erb

        <p><span class="consulta-medico">
          <%= consulta.paciente.present? ? consulta.paciente.nome_completo : "Nome do paciente não associado" %>
---
SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

       <p><span class="consulta-medico">
          <%= consulta.medico.present? ? consulta.medico.nome : "Médico não associado" %>
---
SELECT "medicos".* FROM "medicos" WHERE "medicos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]