app/views/consultas/show.html.erb

SELECT "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
<div id="consulta-details">
    <p><span class="label">Paciente:</span> <span class="value"><%= @consulta&.paciente.present? ? @consulta.paciente.nome_completo : "Paciente não associado" %></span></p>

SELECT "medicos".* FROM "medicos" WHERE "medicos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

    <p><span class="label">Médico: </span><span class="value"><%= @consulta&.medico&.nome.present? ? @consulta.medico.nome : "Médico não associado"%></span></p>